app/controllers/pages_controller.rb

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 980190964 LIMIT 1
---
  def show
  	@page = Page.find(params[:id])